tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
DISCOVERY_L152R.menu.log.default=Release(no-exceptions)
DISCOVERY_L152R.menu.log.default.build.log_level=-fno-exceptions
DISCOVERY_L152R.menu.log.fatal=FATAL
DISCOVERY_L152R.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
DISCOVERY_L152R.menu.log.error=ERROR
DISCOVERY_L152R.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
DISCOVERY_L152R.menu.log.warning=WARNING
DISCOVERY_L152R.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
DISCOVERY_L152R.menu.log.info=INFO
DISCOVERY_L152R.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
DISCOVERY_L152R.menu.log.debug=DEBUG
DISCOVERY_L152R.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
DISCOVERY_L152R.menu.log.trace=TRACE
DISCOVERY_L152R.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

####################################### Discovery F303VC #########################################
# Discovery F303VC board

DISCOVERY_F303VC.name=Discovery F303VC(HSI48M/HSE72M)

DISCOVERY_F303VC.upload.maximum_size=524288
DISCOVERY_F303VC.upload.maximum_data_size=40960

DISCOVERY_F303VC.build.core=arduino
DISCOVERY_F303VC.build.board=DISCOVERY_F303VC

DISCOVERY_F303VC.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F303VC.build.series=STM32F3
DISCOVERY_F303VC.build.variant=DISCOVERY_F303VC
DISCOVERY_F303VC.build.extra_flags=-DSTM32F303VC

DISCOVERY_F303VC.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_F303VC.menu.clock_source.bypass.build.f_cpu=72000000L -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_F303VC.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_F303VC.menu.clock_source.hsi.build.f_cpu=48000000L -DUSE_HSI

DISCOVERY_F303VC.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_F303VC.menu.clock_source.hse8m.build.f_cpu=72000000L -DUSE_HSE -DHSE_VALUE=8000000

DISCOVERY_F303VC.upload.protocol=STLink
DISCOVERY_F303VC.upload.tool=stlink_upload

DISCOVERY_F303VC.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART2

#DISCOVERY_F303VC.menu.usb.Disabled=Disabled USB
#DISCOVERY_F303VC.menu.usb.SerialUSB=Serial [Virtual COM port]
#DISCOVERY_F303VC.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
#DISCOVERY_F303VC.menu.usb.SerialMSC=Mass storage
#DISCOVERY_F303VC.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

#DISCOVERY_F303VC.menu.serial.SerialUSB=SerialUSB
#DISCOVERY_F303VC.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#DISCOVERY_F303VC.menu.serial.SerialUART2=SerialUART2 [PA2/PA3]
#DISCOVERY_F303VC.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
DISCOVERY_F303VC.menu.log.default=Release(no-exceptions)
DISCOVERY_F303VC.menu.log.default.build.log_level=-fno-exceptions
DISCOVERY_F303VC.menu.log.fatal=FATAL
DISCOVERY_F303VC.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
DISCOVERY_F303VC.menu.log.error=ERROR
DISCOVERY_F303VC.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
DISCOVERY_F303VC.menu.log.warning=WARNING
DISCOVERY_F303VC.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
DISCOVERY_F303VC.menu.log.info=INFO
DISCOVERY_F303VC.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
DISCOVERY_F303VC.menu.log.debug=DEBUG
DISCOVERY_F303VC.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
DISCOVERY_F303VC.menu.log.trace=TRACE
DISCOVERY_F303VC.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT
####################################### Discovery F407VG #########################################
# Discovery F407VG board

DISCOVERY_F407VG.name=Discovery F407VG(168M)

DISCOVERY_F407VG.upload.maximum_size=1048576
DISCOVERY_F407VG.upload.maximum_data_size=131072

DISCOVERY_F407VG.build.core=arduino
DISCOVERY_F407VG.build.board=DISCOVERY_F407VG

DISCOVERY_F407VG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F407VG.build.series=STM32F4
DISCOVERY_F407VG.build.variant=DISCOVERY_F407VG
DISCOVERY_F407VG.build.extra_flags=-DSTM32F407VG
DISCOVERY_F407VG.build.f_cpupre=168000000L

DISCOVERY_F407VG.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_F407VG.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_F407VG.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_F407VG.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_F407VG.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_F407VG.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

DISCOVERY_F407VG.menu.subboard.F407VG=Discovery F407VG

DISCOVERY_F407VG.menu.extern_lib.NONE=NONE
DISCOVERY_F407VG.menu.extern_lib.STemWin=STemWin
DISCOVERY_F407VG.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
DISCOVERY_F407VG.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
DISCOVERY_F407VG.menu.extern_lib.STemWinOS=STemWin_OS
DISCOVERY_F407VG.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
DISCOVERY_F407VG.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

DISCOVERY_F407VG.upload.protocol=STLink
DISCOVERY_F407VG.upload.tool=stlink_upload

DISCOVERY_F407VG.menu.serial.SerialUART2=SerialUART2 [PA2/PA3]
DISCOVERY_F407VG.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
DISCOVERY_F407VG.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F407VG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

DISCOVERY_F407VG.menu.usb.Disabled=Disabled USB
DISCOVERY_F407VG.menu.usb.SerialUSB=Serial [Virtual COM port]
DISCOVERY_F407VG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F407VG.menu.usb.SerialMSC=Mass storage
DISCOVERY_F407VG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

