tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
DISCOVERY_F746NG.menu.log.default=Release(no-exceptions)
DISCOVERY_F746NG.menu.log.default.build.log_level=-fno-exceptions
DISCOVERY_F746NG.menu.log.fatal=FATAL
DISCOVERY_F746NG.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.error=ERROR
DISCOVERY_F746NG.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.warning=WARNING
DISCOVERY_F746NG.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.info=INFO
DISCOVERY_F746NG.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.debug=DEBUG
DISCOVERY_F746NG.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.trace=TRACE
DISCOVERY_F746NG.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

######################################F030#######################################
F030F.name=F030F

F030F.upload.uploadadr=0x08000000
F030F.upload.vect=0x08000000
F030F.serial.disableDTR=true
F030F.serial.disableRTS=true

F030F.build.board=F030F
F030F.build.core=arduino
F030F.build.series=STM32F0
F030F.build.mcu=cortex-m0
F030F.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

F030F.menu.subboard.F030F4P632=GENERIC_F030F4P6(32kFlash LED PA4)
F030F.menu.subboard.F030F4P632.upload.maximum_size=32768
F030F.menu.subboard.F030F4P632.upload.maximum_data_size=4096
F030F.menu.subboard.F030F4P632.upload.device=STM32F030F4
F030F.menu.subboard.F030F4P632.build.extra_flags=-DSTM32F030F4
F030F.menu.subboard.F030F4P632.build.variant=F030F4P6
F030F.menu.subboard.F030F4P632.build.board=F030F4P6
F030F.menu.subboard.F030F4P632.build.ldscript=ld/f030f4p6_32.ld

F030F.menu.subboard.F030F4P6=GENERIC_F030F4P6(16kFlash LED PA4)
F030F.menu.subboard.F030F4P6.upload.maximum_size=16384
F030F.menu.subboard.F030F4P6.upload.maximum_data_size=4096
F030F.menu.subboard.F030F4P6.upload.device=STM32F030F4
F030F.menu.subboard.F030F4P6.build.extra_flags=-DSTM32F030F4
F030F.menu.subboard.F030F4P6.build.variant=F030F4P6
F030F.menu.subboard.F030F4P6.build.board=F030F4P6
F030F.menu.subboard.F030F4P6.build.ldscript=ld/f030f4p6.ld

F030F.menu.osc_speed.speed_08m=8M(HSE)_48M(default)
F030F.menu.osc_speed.speed_08m.build.f_cpu=48000000L -DHSE_VALUE=8000000

F030F.menu.osc_speed.speed_08m72=8M(HSE)_72M(Stable)
F030F.menu.osc_speed.speed_08m72.build.f_cpu=72000000L -DHSE_VALUE=8000000

F030F.menu.osc_speed.speed_08m96=8M(HSE)_96M(overdrive)
F030F.menu.osc_speed.speed_08m96.build.f_cpu=96000000L -DHSE_VALUE=8000000

F030F.menu.osc_speed.speed_hsi=8M(HSI)_48M
F030F.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
F030F.menu.upload_method.jLinkMethod=JLink
F030F.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F030F.menu.upload_method.jLinkMethod.upload.protocol=jlink

F030F.menu.upload_method.STLinkMethod=STLink 
F030F.menu.upload_method.STLinkMethod.upload.protocol=STLink
F030F.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

F030F.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F030F.menu.upload_method.serialMethod.upload.protocol=maple_serial
F030F.menu.upload_method.serialMethod.upload.tool=serial_upload

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F030F.menu.log.default=Release(no-exceptions)
F030F.menu.log.default.build.log_level=-fno-exceptions
F030F.menu.log.fatal=FATAL
F030F.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F030F.menu.log.error=ERROR
F030F.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F030F.menu.log.warning=WARNING
F030F.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F030F.menu.log.info=INFO
F030F.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F030F.menu.log.debug=DEBUG
F030F.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F030F.menu.log.trace=TRACE
F030F.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

####################################MapleMini_F103C board############################################
MapleMini.name=MapleMini F103C

MapleMini.upload.uploadadr=0x08000000
MapleMini.upload.vect=0x08000000
MapleMini.serial.disableDTR=true
MapleMini.serial.disableRTS=true

MapleMini.build.mcu=cortex-m3
MapleMini.build.core=arduino
MapleMini.build.board=MAPLE_MINI
MapleMini.build.variant=MAPLE_MINI
MapleMini.build.series=STM32F1

MapleMini.menu.subboard.F103CB=MapleMini F103C8/B[LED PB1/SWD]
MapleMini.menu.subboard.F103CB.upload.maximum_size=131072
MapleMini.menu.subboard.F103CB.upload.maximum_data_size=20480
MapleMini.menu.subboard.F103CB.build.extra_flags=-DSTM32F103CB
MapleMini.menu.subboard.F103CB.build.ldscript_pre=ld/f103xB
MapleMini.menu.subboard.F103CB.build.ldscript=ld/f103xB.ld
MapleMini.menu.subboard.F103CB.build.board=MAPLEMINI_F103CB
MapleMini.menu.subboard.F103CB.build.extra_flags_jtag=-DMENU_DEBUG_SWD

MapleMini.menu.extern_lib.NONE=NONE
MapleMini.menu.extern_lib.STemWin=STemWin
MapleMini.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
MapleMini.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
MapleMini.menu.extern_lib.STemWinOS=STemWin_OS
MapleMini.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
MapleMini.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

MapleMini.menu.clock_source.hse=8M(HSE)_72M
MapleMini.menu.clock_source.hse.build.f_cpu=72000000L -DHSE_VALUE=8000000

MapleMini.menu.clock_source.hsi=8M(HSI)_48M
MapleMini.menu.clock_source.hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
MapleMini.menu.upload_method.STLinkMethod=STLink [Automatic serial=SerialUSB]
MapleMini.menu.upload_method.STLinkMethod.upload.protocol=STLink
MapleMini.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
MapleMini.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini.menu.upload_method.jLinkMethod=JLink [Automatic serial=SerialUSB]
MapleMini.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
MapleMini.menu.upload_method.jLinkMethod.upload.protocol=jlink
MapleMini.menu.upload_method.jLinkMethod.upload.device=STM32F103C8

MapleMini.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10,BOOT0(button)=1(press when reset)]
MapleMini.menu.upload_method.serialMethod.upload.protocol=maple_serial
MapleMini.menu.upload_method.serialMethod.upload.tool=serial_upload
MapleMini.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

MapleMini.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
MapleMini.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
MapleMini.menu.upload_method.BMPMethod.upload.tool=bmp_upload

MapleMini.menu.upload_method.DFUUploadMethod2=USB DFU - STM32duino bootloader (0x2000)
MapleMini.menu.upload_method.DFUUploadMethod2.upload.protocol=maple_dfu
MapleMini.menu.upload_method.DFUUploadMethod2.upload.tool=maple_upload
MapleMini.menu.upload_method.DFUUploadMethod2.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x2000 -DUSB_DISC_PIN=PB9
MapleMini.menu.upload_method.DFUUploadMethod2.build.ldscript={build.ldscript_pre}_bootloader_2000.ld
MapleMini.menu.upload_method.DFUUploadMethod2.upload.usbID=1EAF:0003
MapleMini.menu.upload_method.DFUUploadMethod2.upload.altID=UNUSED
MapleMini.menu.upload_method.DFUUploadMethod2.maximum_data_size=122880
MapleMini.menu.upload_method.DFUUploadMethod2.flash.maximum_size=122880
MapleMini.menu.upload_method.DFUUploadMethod2.ram.maximum_size=20480
MapleMini.menu.upload_method.DFUUploadMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

