tony-cloud/STM32_duino/boards.txt
F103RE.menu.upload_method.jLinkMethod=JLink
F103RE.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103RE.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103RE.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB


F103RE.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F103RE.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103RE.menu.upload_method.serialMethod.upload.tool=serial_upload
F103RE.menu.upload_method.serialMethod.upload.altID=UNUSED
F103RE.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RE.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103RE.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103RE.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103RE.menu.upload_method.serialMethod1.upload.altID=PL2303
F103RE.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RE.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103RE.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103RE.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103RE.menu.upload_method.serialMethod2.upload.altID=CH340
F103RE.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RE.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103RE.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103RE.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103RE.menu.usb.Disabled=Disabled USB
F103RE.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103RE.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103RE.menu.usb.SerialMSC=Mass storage
F103RE.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103RE.menu.usb.Composite=Composite[CDC+MSC]
F103RE.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103RE.menu.serial.SerialUART1=SerialUART1
F103RE.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103RE.menu.serial.SerialUART2=SerialUART2
F103RE.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F103RE.menu.serial.SerialUSB=SerialUSB
F103RE.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#F103RE.menu.jtag_swd.default=Debug_default
F103RE.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103RE.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103RE.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103RE.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103RE.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103RE.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F103RE.menu.log.default=Release(no-exceptions)
F103RE.menu.log.default.build.log_level=-fno-exceptions
F103RE.menu.log.fatal=FATAL
F103RE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F103RE.menu.log.error=ERROR
F103RE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F103RE.menu.log.warning=WARNING
F103RE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F103RE.menu.log.info=INFO
F103RE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F103RE.menu.log.debug=DEBUG
F103RE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F103RE.menu.log.trace=TRACE
F103RE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

##################################F103V board##############################################
F103V.name=F103V(72M)
F103V.vid.0=0x067B
F103V.pid.0=0x2303

F103V.build.mcu=cortex-m3
F103V.build.board=GENERIC_F103V
F103V.build.core=arduino
F103V.build.series=STM32F1
F103V.build.f_cpu=72000000L

F103V.serial.disableDTR=true
F103V.serial.disableRTS=true
F103V.upload.uploadadr=0x08000000
F103V.upload.vect=0x08000000

F103V.menu.subboard.F103VE=ArmFly_X2[F103VC/D/E PL2303]
F103V.menu.subboard.F103VE.upload.maximum_size=524288
F103V.menu.subboard.F103VE.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE.upload.device=STM32F103VE
F103V.menu.subboard.F103VE.build.extra_flags0=-DSTM32F103VE
F103V.menu.subboard.F103VE.build.variant=ARMFLY_X2_F103VE
F103V.menu.subboard.F103VE.build.board=ARMFLY_X2
F103V.menu.subboard.F103VE.build.ldscript=ld/f103xE.ld
F103V.menu.subboard.F103VE.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE.upload.protocol=maple_serial
F103V.menu.subboard.F103VE.upload.tool=serial_upload
F103V.menu.subboard.F103VE.upload.altID=PL2303
F103V.menu.subboard.F103VE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VE1=GENERIC_F103VC/D/E
F103V.menu.subboard.F103VE1.upload.maximum_size=524288
F103V.menu.subboard.F103VE1.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE1.upload.device=STM32F103VE
F103V.menu.subboard.F103VE1.build.extra_flags0=-DSTM32F103VE
F103V.menu.subboard.F103VE1.build.variant=F103V
F103V.menu.subboard.F103VE1.build.board=GENERIC_F103VE
F103V.menu.subboard.F103VE1.build.ldscript=ld/f103xE.ld
F103V.menu.subboard.F103VE1.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE1.upload.protocol=maple_serial
F103V.menu.subboard.F103VE1.upload.tool=serial_upload
F103V.menu.subboard.F103VE1.upload.altID=CH340
F103V.menu.subboard.F103VE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.startadr.default=flash(512k+64k)
F103V.menu.startadr.default.build.extra_flags={build.extra_flags0}

F103V.menu.startadr.F08010000=flash 1:0x08010000(64k)
F103V.menu.startadr.F08010000.upload.maximum_size=65536
F103V.menu.startadr.F08010000.upload.maximum_data_size=65536
F103V.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F103V.menu.startadr.F08010000.build.ldscript=ld/f103xE_0801.ld
F103V.menu.startadr.F08010000.upload.uploadadr=0x08010000
F103V.menu.startadr.F08010000.upload.vect=0x08010000

F103V.menu.startadr.F08020000=flash 2:0x08020000(64k)
F103V.menu.startadr.F08020000.upload.maximum_size=65536
F103V.menu.startadr.F08020000.upload.maximum_data_size=65536
F103V.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F103V.menu.startadr.F08020000.build.ldscript=ld/f103xE_0802.ld
F103V.menu.startadr.F08020000.upload.uploadadr=0x08020000
F103V.menu.startadr.F08020000.upload.vect=0x08020000

