tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F103Z.menu.log.default=Release(no-exceptions)
F103Z.menu.log.default.build.log_level=-fno-exceptions
F103Z.menu.log.fatal=FATAL
F103Z.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F103Z.menu.log.error=ERROR
F103Z.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F103Z.menu.log.warning=WARNING
F103Z.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F103Z.menu.log.info=INFO
F103Z.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F103Z.menu.log.debug=DEBUG
F103Z.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F103Z.menu.log.trace=TRACE
F103Z.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

##################################### F401S ###########################################
F401S.name=F401x

F401S.vid.1=0x0483
F401S.pid.1=0x5740

F401S.serial.disableDTR=true
F401S.serial.disableRTS=true
F401S.upload.maximum_size=262144
F401S.upload.maximum_data_size=65536
F401S.upload.uploadadr=0x08000000
F401S.upload.vect=0x08000000

F401S.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
F401S.build.core=arduino
F401S.build.board=F401NANO
F401S.build.series=STM32F4

F401S.menu.subboard.CCU6F=NANO_CCU6
F401S.menu.subboard.CCU6F.upload.maximum_size=262144
F401S.menu.subboard.CCU6F.upload.maximum_data_size=65536
F401S.menu.subboard.CCU6F.build.variant=F401C
F401S.menu.subboard.CCU6F.build.board=F401NANO
F401S.menu.subboard.CCU6F.build.extra_flags0=-DSTM32F401CC
F401S.menu.subboard.CCU6F.massstorage_drive=NUCLEO
#default upload method
F401S.menu.subboard.CCU6F.upload.device=STM32F401CC
F401S.menu.subboard.CCU6F.upload.tool=stlink_upload
F401S.menu.subboard.CCU6F.upload.protocol=STLink
F401S.menu.subboard.CCU6F.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S.menu.startadr.default=flash(256k+64k)
F401S.menu.startadr.default.build.extra_flags={build.extra_flags0}

F401S.menu.startadr.F08010000=flash 1:0x08010000(64k)
F401S.menu.startadr.F08010000.upload.maximum_size=65536
F401S.menu.startadr.F08010000.upload.maximum_data_size=65536
F401S.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F401S.menu.startadr.F08010000.build.ldscript=ld/f401xC_0801.ld
F401S.menu.startadr.F08010000.upload.uploadadr=0x08010000
F401S.menu.startadr.F08010000.upload.vect=0x08010000

F401S.menu.startadr.F08020000=flash 2:0x08020000(128k)
F401S.menu.startadr.F08020000.upload.maximum_size=131072
F401S.menu.startadr.F08020000.upload.maximum_data_size=65536
F401S.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F401S.menu.startadr.F08020000.build.ldscript=ld/f401xC_0802.ld
F401S.menu.startadr.F08020000.upload.uploadadr=0x08020000
F401S.menu.startadr.F08020000.upload.vect=0x08020000

F401S.menu.startadr.F08000000=flash(WithRamBoot 20kRAM used Only)
F401S.menu.startadr.F08000000.upload.maximum_size=65536
F401S.menu.startadr.F08000000.upload.maximum_data_size=20480
F401S.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F401S.menu.startadr.F08000000.build.ldscript=ld/f401xC_0800.ld
F401S.menu.startadr.F08000000.upload.uploadadr=0x08000000
F401S.menu.startadr.F08000000.upload.vect=0x08000000

F401S.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader only)
F401S.menu.startadr.R20000000.upload.maximum_size=45056
F401S.menu.startadr.R20000000.upload.maximum_data_size=20480
F401S.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F401S.menu.startadr.R20000000.build.ldscript=ld/f401xC_RAM0.ld
F401S.menu.startadr.R20000000.upload.uploadadr=0x20000000
F401S.menu.startadr.R20000000.upload.vect=0x20000000

F401S.menu.extern_lib.NONE=NONE
F401S.menu.extern_lib.STemWin=STemWin
F401S.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
F401S.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F401S.menu.extern_lib.STemWinOS=STemWin_OS
F401S.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
F401S.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

F401S.menu.osc_speed.speed_12m=12M (HSE)
F401S.menu.osc_speed.speed_12m.build.osc=-DHSE_VALUE=12000000 -DOSC=12

F401S.menu.osc_speed.speed_08m=8M (HSE)
F401S.menu.osc_speed.speed_08m.build.osc=-DHSE_VALUE=8000000 -DOSC=8

F401S.menu.osc_speed.speed_hsi=16M (HSI)
F401S.menu.osc_speed.speed_hsi.build.osc=-DUSE_HSI

F401S.menu.cpu_speed.F144=144M(overdrive)
F401S.menu.cpu_speed.F144.build.f_cpu=144000000L {build.osc}

F401S.menu.cpu_speed.F120=120M(Stable)
F401S.menu.cpu_speed.F120.build.f_cpu=120000000L {build.osc}

F401S.menu.cpu_speed.F84=84M(default)
F401S.menu.cpu_speed.F84.build.f_cpu=84000000L {build.osc}

#-------------------------------------- UPLOAD METHODS ----------------------------------------#
F401S.menu.upload_method.jLinkMethod=JLink
F401S.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F401S.menu.upload_method.jLinkMethod.upload.protocol=jlink
F401S.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S.menu.upload_method.STLinkMethod=STLink
F401S.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F401S.menu.upload_method.STLinkMethod.upload.protocol=STLink
F401S.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F401S.menu.upload_method.MassStorageMethod.upload.protocol=
F401S.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F401S.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F401S.menu.upload_method.serialMethod.upload.protocol=maple_serial
F401S.menu.upload_method.serialMethod.upload.tool=serial_upload
F401S.menu.upload_method.serialMethod.upload.altID=UNUSED
F401S.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F401S.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F401S.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F401S.menu.upload_method.serialMethod2.upload.tool=serial_upload
F401S.menu.upload_method.serialMethod2.upload.altID=CH340
F401S.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

