tony-cloud/STM32_duino/boards.txt
#-------------------------------------- UPLOAD METHODS ----------------------------------------#
F407xE.menu.upload_method.jLinkMethod=JLink
F407xE.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F407xE.menu.upload_method.jLinkMethod.upload.protocol=jlink
F407xE.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xE.menu.upload_method.STLinkMethod=STLink
F407xE.menu.upload_method.STLinkMethod.upload.protocol=STLink
F407xE.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F407xE.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xE.menu.upload_method.MassStorageMethod=MassStorage [STLINK V2.1]
F407xE.menu.upload_method.MassStorageMethod.upload.protocol=
F407xE.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F407xE.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F407xE.menu.upload_method.serialMethod.upload.protocol=maple_serial
F407xE.menu.upload_method.serialMethod.upload.tool=serial_upload
F407xE.menu.upload_method.serialMethod.upload.altID=UNUSED
F407xE.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xE.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F407xE.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F407xE.menu.upload_method.serialMethod2.upload.tool=serial_upload
F407xE.menu.upload_method.serialMethod2.upload.altID=CH340
F407xE.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xE.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F407xE.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F407xE.menu.upload_method.serialMethod1.upload.tool=serial_upload
F407xE.menu.upload_method.serialMethod1.upload.altID=PL2303
F407xE.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xE.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F407xE.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F407xE.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F407xE.menu.usb.Disabled=Disabled USB
F407xE.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F407xE.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F407xE.menu.usb.SerialMSC=Mass storage
F407xE.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F407xE.menu.usb.Composite=Composite[CDC+MSC]
F407xE.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F407xE.menu.serial.SerialUART1=SerialUART1
F407xE.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F407xE.menu.serial.SerialUART2=SerialUART2
F407xE.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F407xE.menu.serial.SerialUART3=SerialUART3
F407xE.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F407xE.menu.serial.SerialUSB=SerialUSB
F407xE.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
#F407xE.menu.serial.Automatic=Automatically selected based on upload method

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F407xE.menu.log.default=Release(no-exceptions)
F407xE.menu.log.default.build.log_level=-fno-exceptions
F407xE.menu.log.fatal=FATAL
F407xE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F407xE.menu.log.error=ERROR
F407xE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F407xE.menu.log.warning=WARNING
F407xE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F407xE.menu.log.info=INFO
F407xE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F407xE.menu.log.debug=DEBUG
F407xE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F407xE.menu.log.trace=TRACE
F407xE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

################################### F407V/Z/I #############################################
F407xG.name=F407xG(168M)

F407xG.vid.0=0x1a86
F407xG.pid.0=0x7523

F407xG.vid.1=0x1366
F407xG.pid.1=0x0105

F407xG.serial.disableDTR=true
F407xG.serial.disableRTS=true
F407xG.upload.uploadadr=0x08000000
F407xG.upload.vect=0x08000000

F407xG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
F407xG.build.core=arduino
F407xG.build.board=ARMFLY_F4
F407xG.build.series=STM32F4
F407xG.build.f_cpu=168000000L

F407xG.menu.subboard.ArmFly_F4=ArmFly_F407ZG
F407xG.menu.subboard.ArmFly_F4.upload.maximum_size=1232896
F407xG.menu.subboard.ArmFly_F4.upload.maximum_data_size=131072
F407xG.menu.subboard.ArmFly_F4.build.variant=ARMFLY_F407ZG
F407xG.menu.subboard.ArmFly_F4.build.board=ARMFLY_F4
F407xG.menu.subboard.ArmFly_F4.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407xG.menu.subboard.ArmFly_F4.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.ArmFly_F4.massstorage_drive=NUCLEO
F407xG.menu.subboard.ArmFly_F4.upload.device=STM32F407ZG
#default upload method
F407xG.menu.subboard.ArmFly_F4.upload.protocol=STLink
F407xG.menu.subboard.ArmFly_F4.upload.tool=stlink_upload
F407xG.menu.subboard.ArmFly_F4.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.subboard.IMT407GV21=ILLUMINATI_F407ZG[JLink SerialUART3]
F407xG.menu.subboard.IMT407GV21.upload.maximum_size=1232896
F407xG.menu.subboard.IMT407GV21.upload.maximum_data_size=131072
F407xG.menu.subboard.IMT407GV21.build.variant=ILLUMINATI_F407ZG
F407xG.menu.subboard.IMT407GV21.build.board=IMT407GV21
F407xG.menu.subboard.IMT407GV21.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407xG.menu.subboard.IMT407GV21.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.IMT407GV21.massstorage_drive=NUCLEO
F407xG.menu.subboard.IMT407GV21.upload.device=STM32F407ZG
#default upload method
F407xG.menu.subboard.IMT407GV21.upload.tool=jlink_upload
F407xG.menu.subboard.IMT407GV21.upload.protocol=jlink
F407xG.menu.subboard.IMT407GV21.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3

F407xG.menu.subboard.WAVESHARE_IGT6=WAVESHARE_F407IG
F407xG.menu.subboard.WAVESHARE_IGT6.upload.maximum_size=1232896
F407xG.menu.subboard.WAVESHARE_IGT6.upload.maximum_data_size=131072
F407xG.menu.subboard.WAVESHARE_IGT6.build.variant=WAVESHARE_F407IG
F407xG.menu.subboard.WAVESHARE_IGT6.build.board=WAVESHARE_F407IGT6
F407xG.menu.subboard.WAVESHARE_IGT6.build.extra_flags0=-DSTM32F407IG -DHSE_VALUE=8000000
F407xG.menu.subboard.WAVESHARE_IGT6.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.WAVESHARE_IGT6.upload.device=STM32F407IG
F407xG.menu.subboard.WAVESHARE_IGT6.upload.protocol=STLink
F407xG.menu.subboard.WAVESHARE_IGT6.upload.tool=stlink_upload
F407xG.menu.subboard.WAVESHARE_IGT6.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.subboard.IGT6_CORE=F407IG_CORE[GREEN]
F407xG.menu.subboard.IGT6_CORE.upload.maximum_size=1232896
F407xG.menu.subboard.IGT6_CORE.upload.maximum_data_size=131072
F407xG.menu.subboard.IGT6_CORE.build.variant=F407IG_CORE
F407xG.menu.subboard.IGT6_CORE.build.board=IGT6CORE
F407xG.menu.subboard.IGT6_CORE.build.extra_flags0=-DSTM32F407IG -DHSE_VALUE=8000000
F407xG.menu.subboard.IGT6_CORE.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.IGT6_CORE.upload.device=STM32F407IG
#default upload method
F407xG.menu.subboard.IGT6_CORE.upload.protocol=STLink
F407xG.menu.subboard.IGT6_CORE.upload.tool=stlink_upload
F407xG.menu.subboard.IGT6_CORE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.subboard.BLACK_F407ZG=GENERIC_F407ZG
F407xG.menu.subboard.BLACK_F407ZG.upload.maximum_size=1232896
F407xG.menu.subboard.BLACK_F407ZG.upload.maximum_data_size=131072
F407xG.menu.subboard.BLACK_F407ZG.build.variant=BLACK_F407ZG
F407xG.menu.subboard.BLACK_F407ZG.build.board=GENERIC_F407ZG
F407xG.menu.subboard.BLACK_F407ZG.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407xG.menu.subboard.BLACK_F407ZG.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.BLACK_F407ZG.upload.device=STM32F407ZG
F407xG.menu.subboard.BLACK_F407ZG.upload.protocol=STLink
F407xG.menu.subboard.BLACK_F407ZG.upload.tool=stlink_upload
F407xG.menu.subboard.BLACK_F407ZG.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xG.menu.startadr.default=flash(1024k+128k)
F407xG.menu.startadr.default.build.extra_flags={build.extra_flags0}

F407xG.menu.startadr.F08020000=flash 1:0x08020000(128k)
F407xG.menu.startadr.F08020000.upload.maximum_size=131072
F407xG.menu.startadr.F08020000.upload.maximum_data_size=131072
F407xG.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F407xG.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
F407xG.menu.startadr.F08020000.upload.uploadadr=0x08020000
F407xG.menu.startadr.F08020000.upload.vect=0x08020000

F407xG.menu.startadr.F08040000=flash 2:0x08040000(128k)
F407xG.menu.startadr.F08040000.upload.maximum_size=131072
F407xG.menu.startadr.F08040000.upload.maximum_data_size=131072
F407xG.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F407xG.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
F407xG.menu.startadr.F08040000.upload.uploadadr=0x08040000
F407xG.menu.startadr.F08040000.upload.vect=0x08040000

F407xG.menu.startadr.F08060000=flash 3:0x08060000(128k)
F407xG.menu.startadr.F08060000.upload.maximum_size=131072
F407xG.menu.startadr.F08060000.upload.maximum_data_size=131072
F407xG.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
F407xG.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
F407xG.menu.startadr.F08060000.upload.uploadadr=0x08060000
F407xG.menu.startadr.F08060000.upload.vect=0x08060000

F407xG.menu.startadr.F08080000=flash 4:0x08080000(128k)
F407xG.menu.startadr.F08080000.upload.maximum_size=131072
F407xG.menu.startadr.F08080000.upload.maximum_data_size=131072
F407xG.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
F407xG.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
F407xG.menu.startadr.F08080000.upload.uploadadr=0x08080000
F407xG.menu.startadr.F08080000.upload.vect=0x08080000

