tony-cloud/STM32_duino/boards.txt
F407xG.menu.startadr.F080A0000=flash 5:0x080A0000(128k)
F407xG.menu.startadr.F080A0000.upload.maximum_size=131072
F407xG.menu.startadr.F080A0000.upload.maximum_data_size=131072
F407xG.menu.startadr.F080A0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xA0000
F407xG.menu.startadr.F080A0000.build.ldscript={build.ldscript_pre}_080A.ld
F407xG.menu.startadr.F080A0000.upload.uploadadr=0x080A0000
F407xG.menu.startadr.F080A0000.upload.vect=0x080A0000

F407xG.menu.startadr.F080C0000=flash 6:0x080C0000(128k)
F407xG.menu.startadr.F080C0000.upload.maximum_size=131072
F407xG.menu.startadr.F080C0000.upload.maximum_data_size=131072
F407xG.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
F407xG.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
F407xG.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
F407xG.menu.startadr.F080C0000.upload.vect=0x080C0000

F407xG.menu.startadr.F080E0000=flash 7:0x080E0000(128k)
F407xG.menu.startadr.F080E0000.upload.maximum_size=131072
F407xG.menu.startadr.F080E0000.upload.maximum_data_size=131072
F407xG.menu.startadr.F080E0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xE0000
F407xG.menu.startadr.F080E0000.build.ldscript={build.ldscript_pre}_080E.ld
F407xG.menu.startadr.F080E0000.upload.uploadadr=0x080E0000
F407xG.menu.startadr.F080E0000.upload.vect=0x080E0000

F407xG.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
F407xG.menu.startadr.F08000000.upload.maximum_size=131072
F407xG.menu.startadr.F08000000.upload.maximum_data_size=32768
F407xG.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F407xG.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
F407xG.menu.startadr.F08000000.upload.uploadadr=0x08000000
F407xG.menu.startadr.F08000000.upload.vect=0x08000000

F407xG.menu.startadr.R20000000=Sram 0:0x20000000(96K+32K BOOT=11 St/Jlink uploader only)
F407xG.menu.startadr.R20000000.upload.maximum_size=98304
F407xG.menu.startadr.R20000000.upload.maximum_data_size=32768
F407xG.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F407xG.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
F407xG.menu.startadr.R20000000.upload.uploadadr=0x20000000
F407xG.menu.startadr.R20000000.upload.vect=0x20000000

F407xG.menu.extern_lib.NONE=NONE
F407xG.menu.extern_lib.STemWin=STemWin
F407xG.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
F407xG.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F407xG.menu.extern_lib.STemWinOS=STemWin_OS
F407xG.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
F407xG.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#-------------------------------------- UPLOAD METHODS ----------------------------------------#
F407xG.menu.upload_method.jLinkMethod=JLink
F407xG.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F407xG.menu.upload_method.jLinkMethod.upload.protocol=jlink
F407xG.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xG.menu.upload_method.STLinkMethod=STLink
F407xG.menu.upload_method.STLinkMethod.upload.protocol=STLink
F407xG.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F407xG.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xG.menu.upload_method.MassStorageMethod=MassStorage [STLINK V2.1]
F407xG.menu.upload_method.MassStorageMethod.upload.protocol=
F407xG.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F407xG.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F407xG.menu.upload_method.serialMethod.upload.protocol=maple_serial
F407xG.menu.upload_method.serialMethod.upload.tool=serial_upload
F407xG.menu.upload_method.serialMethod.upload.altID=UNUSED
F407xG.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F407xG.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F407xG.menu.upload_method.serialMethod2.upload.tool=serial_upload
F407xG.menu.upload_method.serialMethod2.upload.altID=CH340
F407xG.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F407xG.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F407xG.menu.upload_method.serialMethod1.upload.tool=serial_upload
F407xG.menu.upload_method.serialMethod1.upload.altID=PL2303
F407xG.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F407xG.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F407xG.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F407xG.menu.usb.Disabled=Disabled USB
F407xG.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F407xG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F407xG.menu.usb.SerialMSC=Mass storage
F407xG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F407xG.menu.usb.Composite=Composite[CDC+MSC]
F407xG.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F407xG.menu.serial.SerialUART1=SerialUART1
F407xG.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F407xG.menu.serial.SerialUART2=SerialUART2
F407xG.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F407xG.menu.serial.SerialUART3=SerialUART3
F407xG.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F407xG.menu.serial.SerialUSB=SerialUSB
F407xG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
#F407xG.menu.serial.Automatic=Automatically selected based on upload method

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F407xG.menu.log.default=Release(no-exceptions)
F407xG.menu.log.default.build.log_level=-fno-exceptions
F407xG.menu.log.fatal=FATAL
F407xG.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F407xG.menu.log.error=ERROR
F407xG.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F407xG.menu.log.warning=WARNING
F407xG.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F407xG.menu.log.info=INFO
F407xG.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F407xG.menu.log.debug=DEBUG
F407xG.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F407xG.menu.log.trace=TRACE
F407xG.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

